app/controllers/api/events_controller.rb

  def index
    if params[:group_id]
      @events = Group.find(params[:group_id]).events.order(start_time: :desc)
    elsif params[:location_id]
      @events = Location.find(params[:location_id]).events.order(start_time: :desc)
    elsif params[:user_id]
      @events = User.find(params[:user_id]).events.order(start_time: :desc)
    elsif params[:category_id]
      @events = Category.find(params[:category_id]).events.order(start_time: :desc)
    else
      @events = Event.all
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]