app/controllers/api/groups_controller.rb

    def index
        if params[:category_id]
            @groups = Category.find(params[:category_id]).groups
        elsif params[:location_id]
            @groups = Location.find(params[:location_id]).groups
        elsif params[:user_id]
            @groups = User.find(params[:user_id]).groups
        else
            @groups = Group.all.includes(:memberships, :members)
---
SELECT "groups".* FROM "groups" WHERE (lat < '36') AND (lat > '35') AND (long > '-121') AND (long < '-122')
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18)
SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" IN ($1, $2, $3, $4, $5)  [["group_id", 1], ["group_id", 2], ["group_id", 3], ["group_id", 4], ["group_id", 5]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]