app/controllers/api/users_controller.rb

SELECT "groups".* FROM "groups"
---
    def index
      if current_user
        @current_user = current_user
      end
      if params[:group_id]
        @users = Group.find(params[:group_id]).members
        render "api/users/index"
      elsif params[:event_id]
        @users = Event.find(params[:event_id]).attendees
        render "api/users/index"
      elsif params[:channel_id]
        @users = Channel.find(params[:channel_id]).users
        render "api/users/index"
      else
        @users = User.all