app/views/api/users/show.json.jbuilder

json.memberships @user.memberships, partial: '/api/users/membership', as: :membership
json.groups @user.groups, partial: '/api/users/group', as: :group
---
SELECT "groups".* FROM "groups"